cases_mixers/rushton/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (air water);

air
{
 /* 
   diameterModel   constant;
    
    constantCoeffs
    {
        d               3e-3; // kohSchwarz2003
    }
 residualAlpha   1e-4;
*/

    diameterModel   PBMmethod;
    PBMmethodCoeffs
    {}
    residualAlpha   1e-4;

}


water
{
    diameterModel constant;
    constantCoeffs
    {
        d               1e-4;
    }
 residualAlpha   1e-4;
}

blending
{
    default
    {
        type            linear;
        residualAlpha   1e-3;
        maxFullyDispersedAlpha.air 0.3;
        maxPartlyDispersedAlpha.air 0.5;
        maxFullyDispersedAlpha.water 0.3;
        maxPartlyDispersedAlpha.water 0.5;
        
        
     //   type            none;
     //   continuousPhase		water;
    }
}

sigma
(
    (air and water)     0.07275
);

aspectRatio
(
    (air in water)
    {
        type            constant;
        E0              1.0;
    }

    (water in air)
    {
        type            constant;
        E0              1.0;
    }
);

drag
(
    (air in water)
    {
        type            SchillerNaumann;
        residualAlpha   1e-3;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (water in air)
    {
        type            SchillerNaumann;
        residualAlpha   1e-3;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (air and water)
    {
        type            segregated;
        residualAlpha   1e-3;
        m               0.5;
        n               8;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (air in water)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    (water in air)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
(
    (air in water)
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
        //type            none;
    }

    (water in air)
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
    }
);

lift
(
/*
	(air in water)
	{
		type			Tomiyama;
	}
	
	(water in air)
	{
		type			none;
	}
*/
);

wallLubrication
(
);

turbulentDispersion
(
 /*   (air in water)
    {
        type            constantCoefficient;
        Ctd             1;
    }
*/

);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
