cases_mixers/rushton/constant/residualAlphaProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      residualAlphaProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


residualAlpha   residualAlpha [ 0 0 0 0 0 0 0 ] 1e-06;

Y_O2Star        Y_O2Star [ 0 0 0 0 0 0 0 ] 0.00732;

maxEpsilon      maxEpsilon [ 0 2 -3 0 0 0 0 ] 100000;


// ************************************************************************* //
