cases_mixers/rushton/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 1e5;

boundaryField
{
    stator
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    rotor
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    spargerWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    shaft
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    top
    {
/*
        type            fixedValue;
        value           uniform 100000;
*/

        type            prghPressure;
        p               $internalField;
        value           $internalField;

    }
    spargerInlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
