cases_mixers/rushton/0/alphat.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      alphat.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    stator
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    rotor
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    spargerInlet
    {
        type            calculated;
        value           $internalField;
    }
    spargerWall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    shaft
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    top
    {
        type            calculated;
        value           $internalField;
    }

}

// ************************************************************************* //
