cases_mixers/rushton/0/epsilon.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    stator
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    rotor
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    spargerInlet
    {
        type            fixedValue;
        value           $internalField;
    }
    spargerWall
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    shaft
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    top
    {
        type            inletOutlet;
        phi             phi.water;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
