cases_mixers/rushton/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0.999999
);

regions
(

    cylinderToCell
    {
       p1       (0 0 0); // start point on cylinder axis
       p2       (0 0 0.26);   // end point on cylinder axis
       radius   0.14;
        fieldValues
        (
            volScalarFieldValue alpha.air 1e-3
        );
    }
);


// ************************************************************************* //
